Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: But what the heck is that?
ja: でも、あれは一体何なんだ？

source: But when the caller passes only two parameters, Z automatically receives the value 0.
ja: しかし、呼び出し側が2つのパラメータだけを渡すと、Zは自動的に値0を受け取ります。

source: But when the same is done with DllCall, MyVar would be uppercase after the following call because CharLower would have operated on a different/temporary string whose contents were identical to MyVar:
ja: しかし、DllCallで同じことをすると、CharLowerがMyVarと同じ内容の別の/一時的な文字列を操作したため、次の呼び出しの後、MyVarは大文字になります：

source: But when you distribute the same sections as part of a whole which is a work based on the Program, the distribution of the whole must be on the terms of this License, whose permissions for other licensees extend to the entire whole, and thus to each and every part regardless of who wrote it.
ja: しかし、あなたが『プログラム』を基にした作品全体の一部として同じ部 分を頒布する場合、その全体の頒布は本許諾書の条項に基づいて行われなけれ ばならず、他のライセンシーに対する許可はその全体、ひいては誰がそれを書いたかにかか わらず一つ一つの部分にまで及ぶ。

source: But why did Notepad work?
ja: しかし、なぜメモ帳が使えたのでしょうか？

source: But without the "m" option, it wouldn't match.
ja: しかし、「m」オプションがなければマッチしない。

source: But you are now wondering if hotstrings have any cool modifiers since hotkeys do.
ja: しかし、ホットキーがそうである以上、ホットストリングにクールなモディファイアがあるのかどうか、あなたは今、疑問に思っているはずだ。

source: Button, CheckBox, Radio, and GroupBox Control Styles
ja: Button、CheckBox、Radio、GroupBoxコントロールのスタイル

source: Button: BS_PUSHBUTTON or BS_DEFPUSHBUTTON
ja: Button：BS_PUSHBUTTONまたはBS_DEFPUSHBUTTON

source: By creating a normal object.
ja: 通常のオブジェクトを作成する。

source: By defining a class.
ja: クラスを定義することによって。

source: By adding the letter Z in front of b0, you would have to type four 1's instead of three to trigger the hotstring twice.
ja: b0の前に文字Zを追加することで、ホットストリングを2回発動させるためには、3回ではなく4回1を入力する必要があります。

source: By adding these windows to a group, you can use GroupDeactivate to visit each window that isn't one of your favorites and decide whether to close it.
ja: これらのウィンドウをグループ化することで、GroupDeactivateを使って、お気に入り以外のウィンドウを訪問し、閉じるかどうかを決定することができます。

source: By assigning a hotkey to this function, you can easily restart the script after saving your changes in an editor.
ja: この機能にホットキーを割り当てることで、エディターで変更内容を保存した後、簡単にスクリプトを再起動することができます。

source: By calling the Func.Bind method, which binds parameter values to a function.
ja: Func.Bindメソッドを呼び出すことで、パラメータ値を関数にバインドする。

source: By calling the ObjBindMethod function, which binds parameter values and a method name to a target object.
ja: ObjBindMethod関数を呼び出すことで、パラメータ値とメソッド名をターゲット・オブジェクトにバインドする。

source: By contrast with the ahk_group criterion (which broadens the search), the search may be narrowed by specifying more than one criterion within the WinTitle parameter.
ja: ahk_group基準（検索範囲を広げる）とは対照的に、WinTitleパラメータに複数の基準を指定することで、検索範囲を狭めることができる。

source: By contrast with the default action for .ahk files:
ja: .ahkファイルに対するデフォルトのアクションとは対照的である：

source: By contrast, #IncludeAgain allows multiple inclusions of the same file, while being the same as #Include in all other respects.
ja: これに対して、#IncludeAgainは、他のすべての点で#Includeと同じでありながら、同じファイルを複数回インクルードすることができます。

source: By contrast, PostMessage places the message in the message queue associated with the target window without waiting for acknowledgement or reply.
ja: 一方、PostMessageは、確認や返信を待たずに、ターゲットウィンドウに関連するメッセージキューにメッセージを配置します。

source: By contrast, SendMessage waits for the target window to process the message, up until the timeout period expires.
ja: 一方、SendMessageは、タイムアウト時間が経過するまで、ターゲットウィンドウがメッセージを処理するのを待ちます。

source: By contrast, GuiControl.Text returns display text, hidden text (the same text returned by ControlGetText) or nothing at all.
ja: 一方、GuiControl.Textは、表示テキスト、非表示テキスト（ControlGetTextが返すテキストと同じ）、または全く何も返しません。

source: By contrast, GuiCtrl.Text returns display text, hidden text (the same text returned by ControlGetText) or nothing at all.
ja: 一方、GuiCtrl.Textは、表示テキスト、非表示テキスト（ControlGetTextが返すテキストと同じ）、または全く何も返しません。

source: By contrast, WinShow will always unhide a hidden window even if hidden windows are not being detected.
ja: これに対して、WinShowは隠しウィンドウが検出されない場合でも、必ず隠しウィンドウを解除します。

source: By contrast, ObjBindMethod produces an object which invokes this.Tick().
ja: これに対し、ObjBindMethodはthis.Tick()を呼び出すオブジェクトを生成します。

source: By contrast, ToolTip do not become modal even though they become owned; they will merely stay always on top of their owner.
ja: これに対して、ToolTipは所有してもモーダルになることはなく、常に所有者の上に乗っているに過ぎない。

source: By contrast, -Wrap would remove the word-wrapping property.
ja: これに対して、-Wrapは、単語の折り返し特性を削除します。

source: By contrast, IsNumber(n) is true if n is a number or a numeric string.
ja: 対照的に、IsNumber(n)はnが数値または数値文字列の場合に真となる。

source: By contrast, ^a:: and ^A:: are equivalent.
ja: これに対して、^a::と^A::は等価です。

source: By contrast, __Get and __Set can be used to implement properties which are known only at the moment they are invoked.
ja: 対照的に、__Getと __Setは、呼び出された瞬間にしかわからないプロパティを実装するために使うことができる。

source: By contrast, AutoHotkey Basic appends the "A" suffix only for functions in User32.dll, Kernel32.dll, ComCtl32.dll, or Gdi32.dll.
ja: 一方、AutoHotkey Basicでは、User32.dll、Kernel32.dll、ComCtl32.dll、Gdi32.dll内の関数に対してのみ「A」サフィックスを付加しています。

source: By contrast, InputHook blocks only text keystrokes by default (VisibleNonText defaults to true), so most hotkeys can be used while an Input is in progress.
ja: 一方、InputHookはデフォルトでテキストキー入力のみをブロックするため（VisibleNonTextのデフォルトはtrue）、入力中にほとんどのホットキーが使用可能です。

source: By contrast, InputHook produces a name if the key has one.
ja: これに対して、InputHookはキーに名前がある場合に名前を生成します。

source: By contrast, InputHook's EndKeys property always returns the normalized name; i.e. whichever character is produced by pressing the key without holding Shift or other modifiers.
ja: 一方、InputHookのEndKeysプロパティは、常に正規化された名前を返します。つまり、Shiftや他の修飾子を使わずにキーを押したときに生じるどの文字も、正規化された名前を返します。

source: By contrast, OS features such as the DIR command omit hidden files by default.
ja: これに対し、DIRコマンドなどのOSの機能は、デフォルトで隠しファイルを省略します。

source: By contrast, a delay of -1 will never sleep.
ja: これに対して、遅延が-1のときは、決してスリープすることはありません。

source: By contrast, a hotstring may also be defined to perform any custom action as in the following examples.
ja: これに対して、ホットストリングは以下の例のように任意のカスタムアクションを実行するように定義することもできます。

source: By contrast, a nested function which is assume-static can still refer to variables from the outer function, unless the function itself is declared static.
ja: 一方、静的と仮定された入れ子の関数は、その関数自体が静的と宣言されていない限り、外側の関数の変数を参照することができます。

source: By contrast, an operator of lower precedence such as add (+) is evaluated after a higher one such as multiply (*).
ja: 一方、加算（+）のような優先順位の低い演算子は、乗算（*）のような優先順位の高い演算子の後に評価されます。

source: By contrast, applying the #UseHook directive or the $ prefix to a keyboard hotkey forces it to require the hook, which causes the hook to be installed if the hotkey is enabled.
ja: これに対して、キーボードホットキーに#UseHookディレクティブまたは$ prefixを適用すると、強制的にフックを要求するようになり、ホットキーが有効になっている場合にフックがインストールされるようになります。

source: By contrast, explicitly launched threads such as hotkeys and menu items can still be launched; but when their threads finish, the underlying thread will still be paused.
ja: 一方、ホットキーや メニュー項目など、明示的に起動されたスレッドはまだ起動可能ですが、それらのスレッドが終了すると、その下にあるスレッドはまだ一時停止しています。

source: By contrast, external functions called via DllCall typically use the numeric value directly.
ja: これに対して、DllCallを介して呼び出される外部関数は、通常、数値を直接使用します。

source: By contrast, if ByRef were not used in the example above, Left and Right would be copies of the caller's variables and thus the Swap function would have no external effect.
ja: 一方、上記の例でByRefを使用しなかった場合、Leftと Rightは呼び出し元の変数のコピーとなるため、Swap関数は外部に影響を与えることはありません。

source: By contrast, if Value is an integer and VarType is VT_DISPATCH, the value is used directly, and therefore must be an IDispatch-compatible interface pointer.
ja: 一方、Valueが整数でVarTypeがVT_DISPATCHの場合は、値が直接使用されるため、IDispatch互換のインターフェースポインタである必要があります。

source: By contrast, if a VK number is used, it will apply to any physical key which produces that VK (and this may vary over time as it depends on the active keyboard layout).
ja: 一方、VK番号を使用する場合は、そのVKを生成するすべての物理キーに適用されます（これは、アクティブなキーボードレイアウトに依存するため、時間と共に変化する可能性があります）。

source: By contrast, if the auto-execute thread turns on Critical but never turns it off, every newly launched thread (such as a hotkey, custom menu item, or timed subroutine) starts off critical.
ja: 対照的に、自動実行スレッドがクリティカルをオンにし、決してオフにしない場合、新しく起動したスレッド（ホットキー、カスタムメニュー項目、時間指定サブルーチンなど）はすべてクリティカルからスタートします。

source: By contrast, if the auto-execute thread turns on this setting but never turns it off, every newly launched thread (such as a hotkey, custom menu item, or timer) starts off immune to interruptions by timers.
ja: 対照的に、自動実行スレッドがこの設定をオンにし、決してオフにしない場合、新しく起動するスレッド（ホットキー、カスタムメニュー項目、タイマーなど）はすべて、タイマーによる中断を受けずに起動する。

source: By contrast, images that lie partially beneath the mouse cursor can usually be detected.
ja: 一方、マウスカーソルの下に部分的にある画像は、通常、検出することができます。

source: By contrast, keys other than LWin and RWin do not need to be blocked because the operating system automatically postpones them until after the SendPlay (via buffering).
ja: 一方、LWinとRWin以外のキーは、OSが自動的にSendPlayの後まで延期するため（バッファリングにより）、ブロックする必要はありません。

source: By contrast, keywords are never interpreted as variable or function names within an expression.
ja: 一方、キーワードは式中の変数名や関数名として解釈されることはありません。

source: By contrast, macros used less often can each be kept in a separate script accessible by means of a shortcut in the Start Menu or on the desktop.
ja: 対照的に、使用頻度の低いマクロは、スタートメニューやデスクトップ上のショートカットからアクセスできる別のスクリプトにそれぞれ保存しておくことができます。

source: By contrast, non-alphanumeric characters such as spaces, tabs, linefeeds (`n), slashes, colons, commas, and other punctuation do not need to be enclosed in single quotes.
ja: 一方、スペース、タブ、ラインフィード（`n）、スラッシュ、コロン、カンマ、その他の句読点などの非英数字は、シングルクォートで囲む必要はない。

source: By contrast, other windowing functions such as WinActivate and WinExist will operate only upon the topmost window of the group.
ja: それに対して、WinActivateやWinExistなどの他のウィンドウ関数は、グループの最上位ウィンドウにのみ作用します。

source: By contrast, pixels beneath the mouse cursor can usually be detected.
ja: 一方、マウスカーソルの下にある画素は、通常、検出することができます。

source: By contrast, returning an integer causes it to be sent immediately as a reply; that is, the program does not process the message any further.
ja: これに対して、整数を返すと、返信としてすぐに送信されます。つまり、プログラムはそれ以上メッセージを処理しません。

source: By contrast, specifying -LV0x20 would remove LVS_EX_FULLROWSELECT.
ja: 一方、-LV0x20を指定すると、LVS_EX_FULLROWSELECTが削除される。

source: By contrast, specifying an absolute position for every control might require you to manually shift the position of all controls that lie beneath and/or to the right of a control that is being enlarged or reduced.
ja: 一方、すべてのコントロールに絶対位置を指定すると、拡大・縮小するコントロールの下や右側にあるすべてのコントロールの位置を手動で移動させる必要がある場合があります。

source: By contrast, specifying an uppercase letter on the right side forces uppercase.
ja: 対照的に、右側に大文字を指定すると、強制的に大文字になる。

source: By contrast, the fast mode inherits global settings from whichever thread happens to be running at the time the function is called.
ja: 一方、高速モードでは、関数が呼び出された時点でたまたま実行されていたスレッドからグローバル設定を継承します。

source: By contrast, the Add method marks the item as expanded in case children are added to it later.
ja: 対照的に、Addメソッドは、後でそのアイテムに子供が追加された場合に備えて、そのアイテムを拡張されたものとしてマークする。

source: By contrast, the GNU General Public License is intended to guarantee your freedom to share and change free software--to make sure the software is free for all its users.
ja: 対照的に、GNU一般公衆利用許諾契約書は、自由ソフトウェアを共有したり変更したりする自由を保証することを目的としている。

source: By contrast, the InstallKeybdHook function can be used to unconditionally install the keyboard hook, which has benefits including:
ja: これに対して、InstallKeybdHook関数を使用すると、無条件でキーボードフックをインストールすることができ、次のようなメリットがあります：

source: By contrast, the InstallMouseHook function can be used to unconditionally install the mouse hook, which has benefits including:
ja: これに対して、InstallMouseHook関数を使えば、無条件でマウスフックを設置することができ、以下のような利点があります：

source: By contrast, the SM_CXVIRTUALSCREEN, SM_CYVIRTUALSCREEN metrics (further above) are the width and height of the virtual screen.
ja: 対照的に、SM_CXVIRTUALSCREEN、SM_CYVIRTUALSCREENメトリクス（さらに上）は、仮想スクリーンの幅と高さです。

source: By contrast, the following example is a simpler demonstration:
ja: 対照的に、以下の例はよりシンプルなデモンストレーションである：

source: By contrast, the length of hotstring's replacement text is limited to about 5000 characters when the sending mode is at its default of SendInput.
ja: 一方、送信モードがデフォルトのSendInputの場合、hotstringの置換テキストの長さは約5000文字に制限されています。

source: By contrast, the other window functions such as WinActivate and WinExist will operate only upon the topmost window of the group.
ja: 一方、WinActivateや WinExistなどの他のウィンドウ機能は、グループの最上位のウィンドウに対してのみ動作します。

source: By contrast, the other windowing functions such as WinActivate and WinExist will operate only on the topmost window of the group.
ja: 対照的に、WinActivateや WinExistなどの他のウィンドウ関数は、グループの一番上のウィンドウに対してのみ動作する。

source: By contrast, the value of A_InitialWorkingDir is determined by how the script was launched.
ja: 対照的に、A_InitialWorkingDirの値は、スクリプトの起動方法によって決定されます。

source: By contrast, this is not necessary if Value is itself a ComValue or ComObject.
ja: 一方、Value自体がComValueまたはComObjectである場合には、この必要はない。

source: By contrast, v1 had exceptions for and/or followed by any of:
ja: 一方、v1では、and/orの後にany ofが続く場合は例外としました：

source: By contrast, v1 had exceptions for and/or followed by any of: <>=/|^:,
ja: 一方、v1では、and/orの後にany ofが続く場合は例外としました：<>=/|^:,

source: By contrast, v1 scripts are "persistent" when at least one of the following is true:
ja: これに対し、v1スクリプトは、以下のうち少なくとも1つが成立する場合に「永続的」であるとします：

source: By convention in AutoHotkey, the first character is at position 1.
ja: AutoHotkeyの慣習では、最初の文字はポジション1になります。

source: By convention, most of these variables start with the prefix A_, so it is best to avoid using this prefix for your own variables.
ja: 慣習上、これらの変数のほとんどは接頭辞A_で始まります。

source: By convention, the function is named by combining the "type" of object and the method name, but this is not a requirement.
ja: 慣習上、関数はオブジェクトの「タイプ」とメソッド名を組み合わせて命名されるが、これは必須条件ではない。

source: By convention, the syntax of each event below is shown with a function name of the form ObjectType_EventName, for clarity.
ja: 慣例により、以下の各イベントの構文は、わかりやすくするために、ObjectType_EventNameという形の関数名で示されています。

source: By declaring it with local, or as a parameter or nested function.
ja: localで宣言したり、パラメータやネストされた関数として宣言することで、その効果を発揮します。

source: By default (that is, if neither SendText nor the Raw mode or Text mode is used), the characters ^+!#{} have a special meaning.
ja: デフォルトでは（つまり、SendTextもRawモードも Textモードも使用しない場合）、文字^+!#{}は特別な意味を持つ。

source: By default the installer will install to "%A_ProgramFiles%\AutoHotkey" for all users.
ja: デフォルトでは、インストーラーは全ユーザーの「%A_ProgramFiles%\AutoHotkey」にインストールします。

source: By default this executes the launcher, which tries to select an appropriate UIA.exe file to run the script.
ja: デフォルトでは、ランチャーが実行され、スクリプトを実行するために適切なUIA.exeファイルを選択しようとします。

source: By default, User Account Control (UAC) protects "elevated" programs (that is, programs which are running as admin) from being automated by non-elevated programs, since that would allow them to bypass security restrictions.
ja: デフォルトでは、ユーザーアカウント制御（UAC）は、「昇格」プログラム（つまり、管理者として実行されているプログラム）が、非昇格プログラムによってセキュリティ制限を回避できるようにするため、自動化から保護します。

source: By default, hook hotkeys and hotstrings ignore keyboard and mouse events generated by any AutoHotkey script.
ja: デフォルトでは、フックホットキーと ホットストリングは、AutoHotkeyスクリプトによって生成されたキーボードとマウスイベントを無視します。

source: By default, target.Method returns funcObj and attempting to assign to target.Method throws an error.
ja: デフォルトでは、target.Methodは funcObjを返し、target.Methodに代入しようとするとエラーがスローされます。

source: By default, AutoHotkey treats the handle as though it loaded the image from file - for example, a bitmap used on a Picture control is deleted when the GUI is destroyed, and an image will generally be deleted immediately if it needs to be resized.
ja: デフォルトでは、AutoHotkeyは画像をファイルから読み込んだものとしてハンドルを扱います。例えば、ピクチャコントロールで使用されているビットマップは、GUIが破棄されると削除されますし、画像のサイズを変更する必要がある場合は、通常すぐに削除されます。

source: By default, Send will not automatically release a modifier key (Control, Shift, Alt, and Win) if that modifier key was "pressed down" by sending it.
ja: デフォルトでは、送信によって修飾キー（Control、Shift、Alt、Win）が「押下」された場合、送信は自動的に修飾キーを解除しません。

source: By default, StrGet only copies up to the first binary zero.
ja: デフォルトでは、StrGetは最初のバイナリ・ゼロまでしかコピーしない。

source: By default, WinShow is the only function that can always detect hidden windows.
ja: デフォルトでは、WinShowは常に隠しウィンドウを検出できる唯一の機能です。

source: By default, WinWait will wait indefinitely for a matching window to appear.
ja: デフォルトでは、WinWaitは一致するウィンドウが表示されるまで無期限に待機します。

source: By default, \R matches `n, `r and `r`n; this behaviour can be restored by combining options as follows:
ja: デフォルトで\Rは、`n, `r, `r`nにマッチする：

source: By default, \R matches `n, `r and `r`n; this behaviour can be restored by combining options as follows: `a)(*BSR_ANYCRLF)
ja: デフォルトで\Rは、`n、`r、`r`nにマッチする：`a)(*BSR_ANYCRLF)

source: By default, a GUI window uses WS_POPUP, WS_CAPTION, WS_SYSMENU, and WS_MINIMIZEBOX.
ja: デフォルトでは、GUIウィンドウはWS_POPUP、WS_CAPTION、WS_SYSMENU、WS_MINIMIZEBOXを使用します。

source: By default, a dot matches any single character except `r (carriage return) or `n (linefeed), but this can be changed by using the DotAll (s), linefeed (`n), carriage return (`r), or `a options.
ja: デフォルトでは、ドットは `r（キャリッジリターン）または `n（ラインフィード）以外の任意の1文字にマッチするが、これはDotAll（s）、ラインフィード（`n）、キャリッジリターン（`r）、または`aオプションを使うことで変更できる。

source: By default, a given hotkey or hotstring subroutine cannot be run a second time if it is already running.
ja: デフォルトでは、指定したホットキーまたはホットストリングのサブルーチンがすでに実行されている場合、2回目の実行はできません。

source: By default, a nested function automatically "captures" a non-static local variable of an outer function when the following requirements are met:
ja: デフォルトでは、以下の条件を満たす場合、入れ子関数は外側の関数の非静的ローカル変数を自動的に「キャプチャ」します：

source: By default, a nested function may access any static variable of any function which encloses it, even dynamically.
ja: デフォルトでは、ネストされた関数は、それを囲む関数の静的変数に、動的にもアクセスすることができます。

source: By default, a window title can contain WinTitle or ExcludeTitle anywhere inside it to be a match, unless changed with SetTitleMatchMode.
ja: SetTitleMatchModeで変更しない限り、初期設定ではウィンドウタイトルのどこかにWinTitleまたはExcludeTitleを含んでいればマッチします。

source: By default, all warnings are enabled and use the MsgBox mode, except for LocalSameAsGlobal, which is disabled.
ja: デフォルトでは、LocalSameAsGlobalを除き、すべての警告が有効でMsgBoxモードが使用され、無効になっています。

source: By default, an error message is displayed based on what was thrown.
ja: デフォルトでは、スローされた内容に応じたエラーメッセージが表示される。

source: By default, any click of the left or right mouse button will reset the hotstring recognizer.
ja: デフォルトでは、マウスの左ボタンまたは右ボタンをクリックすると、ホットストリング認識機能がリセットされます。

source: By default, characters are sent by first translating them to keystrokes.
ja: デフォルトでは、文字はまずキーストロークに変換されて送信されます。

source: By default, double-clicking the tray icon shows the script's main window.
ja: デフォルトでは、トレイアイコンをダブルクリックすると、スクリプトのメインウィンドウが表示されます。

source: By default, each of these controls except GroupBox uses the styles BS_MULTILINE (unless it has no explicitly set width or height, nor any CR/LF characters in their text) and WS_TABSTOP (however, Radio controls other than the first of each radio group lack WS_TABSTOP).
ja: デフォルトでは、GroupBox以外のコントロールは、BS_MULTILINEスタイル（明示的に幅や高さが設定されていない場合、またテキストにCR/LF文字が含まれていない場合）とWS_TABSTOPスタイルを使用します（ただし、各ラジオ・グループの先頭以外のラジオ・コントロールにはWS_TABSTOPスタイルがありません）。

source: By default, each of these controls uses WS_TABSTOP.
ja: デフォルトでは、これらのコントロールはWS_TABSTOPを使用します。

source: By default, each script adds its own icon to the taskbar notification area (commonly known as the tray).
ja: デフォルトでは、各スクリプトはタスクバーの通知領域（一般にトレイと呼ばれる）に独自のアイコンを追加します。

source: By default, every newly launched thread is uninterruptible for a Duration of 15 milliseconds or a LineCount of 1000 script lines, whichever comes first.
ja: デフォルトでは、新しく起動されたスレッドは、継続時間15ミリ秒またはLineCountが1000スクリプト行のどちらか早い方の間、中断されない。

source: By default, functions expect a substring of the window title.
ja: デフォルトでは、関数はウィンドウタイトルの部分文字列を期待します。

source: By default, hidden text elements are detected unless changed with DetectHiddenText.
ja: DetectHiddenTextで変更しない限り、初期設定では非表示テキストは検出されます。

source: By default, hidden windows are ignored (except by WinShow).
ja: デフォルトでは、隠しウィンドウは無視されます（WinShowを除く）。

source: By default, hidden windows are not detected and hidden text elements are detected, unless changed with DetectHiddenWindows and DetectHiddenText.
ja: DetectHiddenWindows関数とDetectHiddenText関数で変更しない限り、初期設定では非表示ウィンドウは検出されず、非表示テキストは検出されます。

source: By default, hidden windows are not detected and hidden text elements are detected, unless changed with DetectHiddenWindows and DetectHiddenText; however, when using pure HWNDs, hidden windows are always detected regardless of DetectHiddenWindows.
ja: DetectHiddenWindows関数とDetectHiddenText関数で変更しない限り、初期設定では非表示ウィンドウは検出されず、非表示テキストは検出されます。ただし、pure HWNDsを使ったときは、DetectHiddenWindowsの設定にかかわらず、非表示ウィンドウは常に検出されます。

source: By default, hotkeys that use the keyboard hook cannot be triggered by means of the Send function.
ja: デフォルトでは、キーボードフックを使用するホットキーは、Send機能によってトリガーすることができません。

source: By default, hotstrings are never triggered by keystrokes produced by any AutoHotkey script.
ja: デフォルトでは、ホットストリングは、AutoHotkeyスクリプトによって生成されたキーストロークによってトリガーされることはありません。

source: By default, it uses DTS_SHORTDATECENTURYFORMAT and WS_TABSTOP.
ja: デフォルトでは、DTS_SHORTDATECENTURYFORMATと WS_TABSTOPを使用します。

source: By default, it uses PBS_SMOOTH.
ja: デフォルトではPBS_SMOOTHを使用する。

source: By default, it uses SBARS_TOOLTIPS and SBARS_SIZEGRIP (the latter only if the window is resizable).
ja: デフォルトでは、SBARS_TOOLTIPSと SBARS_SIZEGRIPを使用します（後者はウィンドウのサイズが変更可能な場合のみ）。

source: By default, it uses UDS_ARROWKEYS, UDS_ALIGNRIGHT, UDS_SETBUDDYINT, and UDS_AUTOBUDDY.
ja: デフォルトでは、UDS_ARROWKEYS、UDS_ALIGNRIGHT、UDS_SETBUDDYINT、UDS_AUTOBUDDYを使用します。

source: By default, it uses WS_TABSTOP and TCS_MULTILINE.
ja: デフォルトでは、WS_TABSTOPと TCS_MULTILINEを使用する。

source: By default, it uses WS_TABSTOP and WS_EX_CLIENTEDGE (extended style E0x200).
ja: デフォルトでは、WS_TABSTOPとWS_EX_CLIENTEDGE（拡張スタイルE0x200）を使用します。

source: By default, it uses WS_TABSTOP, LBS_USETABSTOPS, WS_VSCROLL, and WS_EX_CLIENTEDGE (extended style E0x200).
ja: デフォルトでは、WS_TABSTOP、LBS_USETABSTOPS、WS_VSCROLL、WS_EX_CLIENTEDGE（拡張スタイルE0x200）を使用します。

source: By default, it uses WS_TABSTOP, LVS_REPORT, LVS_SHOWSELALWAYS, LVS_EX_FULLROWSELECT, LVS_EX_HEADERDRAGDROP, and WS_EX_CLIENTEDGE (extended style E0x200).
ja: デフォルトでは、WS_TABSTOP、LVS_REPORT、LVS_SHOWSELALWAYS、LVS_EX_FULLROWSELECT、LVS_EX_HEADERDRAGDROP、WS_EX_CLIENTEDGE（拡張スタイルE0x200）を使用します。

source: By default, it uses WS_TABSTOP, TVS_SHOWSELALWAYS, TVS_HASLINES, TVS_LINESATROOT, TVS_HASBUTTONS, and WS_EX_CLIENTEDGE (extended style E0x200).
ja: デフォルトでは、WS_TABSTOP、TVS_SHOWSELALWAYS、TVS_HASLINES、TVS_LINESATROOT、TVS_HASBUTTONS、WS_EX_CLIENTEDGE（拡張スタイルE0x200）を使用します。

source: By default, it uses WS_TABSTOP.
ja: デフォルトでは、WS_TABSTOPを使用する。

source: By default, item text may wrap in icon view.
ja: デフォルトでは、アイテムのテキストはアイコン表示で折り返されることがあります。

source: By default, leading spaces or tabs are omitted based on the indentation of the first line inside the continuation section.
ja: デフォルトでは、継続セクション内の最初の行のインデントに基づいて、先頭のスペースやタブが省略される。

source: By default, load-time errors and warnings are displayed as usual.
ja: デフォルトでは、ロードタイムエラーと警告は通常通り表示される。

source: By default, mode 2 takes precedence over mode 1.
ja: デフォルトでは、モード2がモード1より優先されます。

source: By default, modifier keystrokes (Ctrl, Alt, Shift, and Win) are sent as they normally would be by the Send function.
ja: デフォルトでは、修飾キー操作（Ctrl、Alt、Shift、Win）は、Send機能によって通常と同じように送信されます。

source: By default, multiple items can be selected.
ja: デフォルトでは、複数の項目を選択することができる。

source: By default, only ASCII letters are considered.
ja: デフォルトでは、ASCII文字のみが考慮されます。

source: By default, only `r`n, `n and `r are recognized.
ja: デフォルトでは、`r`n、`n と `r のみが認識される。
